app/views/recipes/show.html.erb


            <% @recipe.recipe_foods.each do |recipe_food|%>
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]