app/views/home/index.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN ($1, $2, $3)  [["recipe_id", 5], ["recipe_id", 4], ["recipe_id", 3]]
SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 3]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 5]]
---
               <div class="col-md-8">
                  <h6>Total food items: <%= recipe.recipe_foods.count %></h6>
                  <h6>Total price: $<%= recipe.recipe_foods.map { |rf| rf.food.price * rf.quantity }.sum %>