app/views/recipe_foods/new.html.erb

                        <%= f.label :food_id %><br />
                        <%= f.collection_select(:food_id, Food.where(user_id: current_user.id).order(:name), :id, :name, { prompt: 'Please select a food' }, { class: 'form-control form-control-lg' }) %>
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 ORDER BY "foods"."name" ASC  [["user_id", 3]]