app/views/recipe_foods/new.html.erb

SELECT "foods".* FROM "foods" ORDER BY "foods"."name" ASC
---
                        <%= f.label :food_id %><br />
                        <%= f.collection_select(:food_id, Food.order(:name), :id, :name, { prompt: 'Please select a food' }, { class: 'form-control form-control-lg' }) %>