app/controllers/foods_controller.rb

  def index
    @foods = Food.where(user_id: current_user.id)
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 2]]