app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "cake"], ["measurement_unit", nil], ["price", nil], ["quantity", nil], ["created_at", "2023-10-12 12:23:05.857801"], ["updated_at", "2023-10-12 12:23:05.857801"], ["user_id", 1]]
---
  def create
    @food = Food.new(food_params)
    @food.user_id = current_user.id
    if @food.save

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
---
  def destroy
    @food = Food.find(params[:id])
    @food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_food
    @food = Food.find(params[:id])