app/controllers/home_controller.rb

  def index
    @recipes = Recipe.includes(:recipe_foods).where(public: true).order(created_at: :desc)
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN ($1, $2, $3)  [["recipe_id", 5], ["recipe_id", 4], ["recipe_id", 3]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 ORDER BY "recipes"."created_at" DESC  [["public", true]]