app/controllers/recipe_foods_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    puts params[:recipe_id]
    @recipe = Recipe.find(params[:recipe_id])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("quantity", "created_at", "updated_at", "recipe_id", "food_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 2332], ["created_at", "2023-10-13 08:20:52.503699"], ["updated_at", "2023-10-13 08:20:52.503699"], ["recipe_id", 3], ["food_id", 1]]
---
  def create
    @recipe = Recipe.find(params[:format])
    @recipe_food = @recipe.recipe_foods.new(recipe_foods_params)

    if @recipe_food.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 2]]
---
  def destroy
    @recipe = Recipe.find(params[:recipe_id])
    @recipe_food = RecipeFood.find(params[:id])
    @recipe_food.destroy!