app/controllers/shopping_lists_controller.rb

  def index
    recipe_id = params[:recipe_id]
    return unless recipe_id.present?

    @recipe = Recipe.includes(:recipe_foods).find(recipe_id)
    @foods = current_user.foods
    @recipe_foods = @recipe.recipe_foods
    @items_to_buy = 0
    @needed_money = 0
    @recipe_foods.each do |recipe_food|
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]