app/controllers/shopping_lists_controller.rb

  def index
    recipe_id = params[:recipe_id]
    return unless recipe_id.present?

    @recipe = Recipe.includes(:recipe_foods).find(recipe_id)
    @recipe_foods = @recipe.recipe_foods
    @total_amount = 0
    @shopping_list = []
    @foods = current_user.foods
    @foods.each do |food|
      available_quantity = food.quantity
      required_quantity = RecipeFood.where(food_id: food.id).sum(:quantity)
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 2]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
SELECT SUM("recipe_foods"."quantity") FROM "recipe_foods" WHERE "recipe_foods"."food_id" = $1  [["food_id", 3]]